apache/nuttx/arch/arm/src/stm32h7/hardware/stm32h7rsxx_rcc.h
/****************************************************************************
 * arch/arm/src/stm32h7/hardware/stm32h7rsxx_rcc.h
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_STM32H7_HARDWARE_STM32H7RSXX_RCC_H
#define __ARCH_ARM_SRC_STM32H7_HARDWARE_STM32H7RSXX_RCC_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include "stm32_memorymap.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Register Offsets *********************************************************/

#define STM32_RCC_CR_OFFSET             0x0000 /* Clock control */
#define STM32_RCC_HSICFGR_OFFSET        0x0004 /* HSI configuration */
#define STM32_RCC_CRRCR_OFFSET          0x0008 /* HSI48 configuration */
#define STM32_RCC_CSICFGR_OFFSET        0x000c /* CSI configuration */
#define STM32_RCC_CFGR_OFFSET           0x0010 /* Clock configuration */
#define STM32_RCC_CDCFGR_OFFSET         0x0018 /* CPU domain configuration */
#define STM32_RCC_BMCFGR_OFFSET         0x001c /* Bus matrix configuration */
#define STM32_RCC_APBCFGR_OFFSET        0x0020 /* APB configuration */
#define STM32_RCC_PLLCKSELR_OFFSET      0x0028 /* PLL clock selection */
#define STM32_RCC_PLLCFGR_OFFSET        0x002c /* PLL configuration */
#define STM32_RCC_PLL1DIVR1_OFFSET      0x0030 /* PLL1 dividers N/P/Q/R */
#define STM32_RCC_PLL1FRACR_OFFSET      0x0034 /* PLL1 fraction */
#define STM32_RCC_PLL2DIVR1_OFFSET      0x0038 /* PLL2 dividers N/P/Q/R */
#define STM32_RCC_PLL2FRACR_OFFSET      0x003c /* PLL2 fraction */
#define STM32_RCC_PLL3DIVR1_OFFSET      0x0040 /* PLL3 dividers N/P/Q/R */
#define STM32_RCC_PLL3FRACR_OFFSET      0x0044 /* PLL3 fraction */
#define STM32_RCC_CCIPR1_OFFSET         0x004c /* Kernel clocks 1 */
#define STM32_RCC_CCIPR2_OFFSET         0x0050 /* Kernel clocks 2 */
#define STM32_RCC_CCIPR3_OFFSET         0x0054 /* Kernel clocks 3 */
#define STM32_RCC_CCIPR4_OFFSET         0x0058 /* Kernel clocks 4 */
#define STM32_RCC_CIER_OFFSET           0x0060 /* Clock interrupt enable */
#define STM32_RCC_CIFR_OFFSET           0x0064 /* Clock interrupt flags */
#define STM32_RCC_CICR_OFFSET           0x0068 /* Clock interrupt clear */
#define STM32_RCC_BDCR_OFFSET           0x0070 /* Backup domain control */
#define STM32_RCC_CSR_OFFSET            0x0074 /* Clock control/status */
#define STM32_RCC_AHB5RSTR_OFFSET       0x007c /* AHB5 reset */
#define STM32_RCC_AHB1RSTR_OFFSET       0x0080 /* AHB1 reset */
#define STM32_RCC_AHB2RSTR_OFFSET       0x0084 /* AHB2 reset */
#define STM32_RCC_AHB4RSTR_OFFSET       0x0088 /* AHB4 reset */
#define STM32_RCC_APB5RSTR_OFFSET       0x008c /* APB5 reset */
#define STM32_RCC_APB1RSTR1_OFFSET      0x0090 /* APB1 reset 1 */
#define STM32_RCC_APB1RSTR2_OFFSET      0x0094 /* APB1 reset 2 */
#define STM32_RCC_APB2RSTR_OFFSET       0x0098 /* APB2 reset */
#define STM32_RCC_APB4RSTR_OFFSET       0x009c /* APB4 reset */
#define STM32_RCC_AHB3RSTR_OFFSET       0x00a4 /* AHB3 reset */
#define STM32_RCC_CKGDISR_OFFSET        0x00b0 /* Clock generator disable */
#define STM32_RCC_PLL1DIVR2_OFFSET      0x00c0 /* PLL1 divider S */
#define STM32_RCC_PLL2DIVR2_OFFSET      0x00c4 /* PLL2 dividers S/T */
#define STM32_RCC_PLL3DIVR2_OFFSET      0x00c8 /* PLL3 divider S */
#define STM32_RCC_PLL1SSCGR_OFFSET      0x00cc /* PLL1 spread spectrum */
#define STM32_RCC_PLL2SSCGR_OFFSET      0x00d0 /* PLL2 spread spectrum */
#define STM32_RCC_PLL3SSCGR_OFFSET      0x00d4 /* PLL3 spread spectrum */
#define STM32_RCC_CKPROTR_OFFSET        0x0100 /* Clock protection */
#define STM32_RCC_RSR_OFFSET            0x0130 /* Reset status */
#define STM32_RCC_AHB5ENR_OFFSET        0x0134 /* AHB5 clock enable */
#define STM32_RCC_AHB1ENR_OFFSET        0x0138 /* AHB1 clock enable */
#define STM32_RCC_AHB2ENR_OFFSET        0x013c /* AHB2 clock enable */
#define STM32_RCC_AHB4ENR_OFFSET        0x0140 /* AHB4 clock enable */
#define STM32_RCC_APB5ENR_OFFSET        0x0144 /* APB5 clock enable */
#define STM32_RCC_APB1ENR1_OFFSET       0x0148 /* APB1 clock enable 1 */
#define STM32_RCC_APB1ENR2_OFFSET       0x014c /* APB1 clock enable 2 */
#define STM32_RCC_APB2ENR_OFFSET        0x0150 /* APB2 clock enable */
#define STM32_RCC_APB4ENR_OFFSET        0x0154 /* APB4 clock enable */
#define STM32_RCC_AHB3ENR_OFFSET        0x0158 /* AHB3 clock enable */
#define STM32_RCC_AHB5LPENR_OFFSET      0x015c /* AHB5 sleep enable */
#define STM32_RCC_AHB1LPENR_OFFSET      0x0160 /* AHB1 sleep enable */
#define STM32_RCC_AHB2LPENR_OFFSET      0x0164 /* AHB2 sleep enable */
#define STM32_RCC_AHB4LPENR_OFFSET      0x0168 /* AHB4 sleep enable */
#define STM32_RCC_AHB3LPENR_OFFSET      0x016c /* AHB3 sleep enable */
#define STM32_RCC_APB1LPENR1_OFFSET     0x0170 /* APB1 sleep enable 1 */
#define STM32_RCC_APB1LPENR2_OFFSET     0x0174 /* APB1 sleep enable 2 */
#define STM32_RCC_APB2LPENR_OFFSET      0x0178 /* APB2 sleep enable */
#define STM32_RCC_APB4LPENR_OFFSET      0x017c /* APB4 sleep enable */
#define STM32_RCC_APB5LPENR_OFFSET      0x0180 /* APB5 sleep enable */

