apache/nuttx/arch/arm/src/stm32h7/hardware/stm32h7rsxx_rcc.h
/* Register Addresses *******************************************************/

#define STM32_RCC_CR                    (STM32_RCC_BASE + STM32_RCC_CR_OFFSET)
#define STM32_RCC_HSICFGR               (STM32_RCC_BASE + STM32_RCC_HSICFGR_OFFSET)
#define STM32_RCC_CRRCR                 (STM32_RCC_BASE + STM32_RCC_CRRCR_OFFSET)
#define STM32_RCC_CSICFGR               (STM32_RCC_BASE + STM32_RCC_CSICFGR_OFFSET)
#define STM32_RCC_CFGR                  (STM32_RCC_BASE + STM32_RCC_CFGR_OFFSET)
#define STM32_RCC_CDCFGR                (STM32_RCC_BASE + STM32_RCC_CDCFGR_OFFSET)
#define STM32_RCC_BMCFGR                (STM32_RCC_BASE + STM32_RCC_BMCFGR_OFFSET)
#define STM32_RCC_APBCFGR               (STM32_RCC_BASE + STM32_RCC_APBCFGR_OFFSET)
#define STM32_RCC_PLLCKSELR             (STM32_RCC_BASE + STM32_RCC_PLLCKSELR_OFFSET)
#define STM32_RCC_PLLCFGR               (STM32_RCC_BASE + STM32_RCC_PLLCFGR_OFFSET)
#define STM32_RCC_PLL1DIVR1             (STM32_RCC_BASE + STM32_RCC_PLL1DIVR1_OFFSET)
#define STM32_RCC_PLL1FRACR             (STM32_RCC_BASE + STM32_RCC_PLL1FRACR_OFFSET)
#define STM32_RCC_PLL2DIVR1             (STM32_RCC_BASE + STM32_RCC_PLL2DIVR1_OFFSET)
#define STM32_RCC_PLL2FRACR             (STM32_RCC_BASE + STM32_RCC_PLL2FRACR_OFFSET)
#define STM32_RCC_PLL3DIVR1             (STM32_RCC_BASE + STM32_RCC_PLL3DIVR1_OFFSET)
#define STM32_RCC_PLL3FRACR             (STM32_RCC_BASE + STM32_RCC_PLL3FRACR_OFFSET)
#define STM32_RCC_CCIPR1                (STM32_RCC_BASE + STM32_RCC_CCIPR1_OFFSET)
#define STM32_RCC_CCIPR2                (STM32_RCC_BASE + STM32_RCC_CCIPR2_OFFSET)
#define STM32_RCC_CCIPR3                (STM32_RCC_BASE + STM32_RCC_CCIPR3_OFFSET)
#define STM32_RCC_CCIPR4                (STM32_RCC_BASE + STM32_RCC_CCIPR4_OFFSET)
#define STM32_RCC_CIER                  (STM32_RCC_BASE + STM32_RCC_CIER_OFFSET)
#define STM32_RCC_CIFR                  (STM32_RCC_BASE + STM32_RCC_CIFR_OFFSET)
#define STM32_RCC_CICR                  (STM32_RCC_BASE + STM32_RCC_CICR_OFFSET)
#define STM32_RCC_BDCR                  (STM32_RCC_BASE + STM32_RCC_BDCR_OFFSET)
#define STM32_RCC_CSR                   (STM32_RCC_BASE + STM32_RCC_CSR_OFFSET)
#define STM32_RCC_AHB5RSTR              (STM32_RCC_BASE + STM32_RCC_AHB5RSTR_OFFSET)
#define STM32_RCC_AHB1RSTR              (STM32_RCC_BASE + STM32_RCC_AHB1RSTR_OFFSET)
#define STM32_RCC_AHB2RSTR              (STM32_RCC_BASE + STM32_RCC_AHB2RSTR_OFFSET)
#define STM32_RCC_AHB4RSTR              (STM32_RCC_BASE + STM32_RCC_AHB4RSTR_OFFSET)
#define STM32_RCC_APB5RSTR              (STM32_RCC_BASE + STM32_RCC_APB5RSTR_OFFSET)
#define STM32_RCC_APB1RSTR1             (STM32_RCC_BASE + STM32_RCC_APB1RSTR1_OFFSET)
#define STM32_RCC_APB1RSTR2             (STM32_RCC_BASE + STM32_RCC_APB1RSTR2_OFFSET)
#define STM32_RCC_APB2RSTR              (STM32_RCC_BASE + STM32_RCC_APB2RSTR_OFFSET)
#define STM32_RCC_APB4RSTR              (STM32_RCC_BASE + STM32_RCC_APB4RSTR_OFFSET)
#define STM32_RCC_AHB3RSTR              (STM32_RCC_BASE + STM32_RCC_AHB3RSTR_OFFSET)
#define STM32_RCC_CKGDISR               (STM32_RCC_BASE + STM32_RCC_CKGDISR_OFFSET)
#define STM32_RCC_PLL1DIVR2             (STM32_RCC_BASE + STM32_RCC_PLL1DIVR2_OFFSET)
#define STM32_RCC_PLL2DIVR2             (STM32_RCC_BASE + STM32_RCC_PLL2DIVR2_OFFSET)
#define STM32_RCC_PLL3DIVR2             (STM32_RCC_BASE + STM32_RCC_PLL3DIVR2_OFFSET)
#define STM32_RCC_PLL1SSCGR             (STM32_RCC_BASE + STM32_RCC_PLL1SSCGR_OFFSET)
#define STM32_RCC_PLL2SSCGR             (STM32_RCC_BASE + STM32_RCC_PLL2SSCGR_OFFSET)
#define STM32_RCC_PLL3SSCGR             (STM32_RCC_BASE + STM32_RCC_PLL3SSCGR_OFFSET)
#define STM32_RCC_CKPROTR               (STM32_RCC_BASE + STM32_RCC_CKPROTR_OFFSET)
#define STM32_RCC_RSR                   (STM32_RCC_BASE + STM32_RCC_RSR_OFFSET)
#define STM32_RCC_AHB5ENR               (STM32_RCC_BASE + STM32_RCC_AHB5ENR_OFFSET)
#define STM32_RCC_AHB1ENR               (STM32_RCC_BASE + STM32_RCC_AHB1ENR_OFFSET)
#define STM32_RCC_AHB2ENR               (STM32_RCC_BASE + STM32_RCC_AHB2ENR_OFFSET)
#define STM32_RCC_AHB4ENR               (STM32_RCC_BASE + STM32_RCC_AHB4ENR_OFFSET)
#define STM32_RCC_APB5ENR               (STM32_RCC_BASE + STM32_RCC_APB5ENR_OFFSET)
#define STM32_RCC_APB1ENR1              (STM32_RCC_BASE + STM32_RCC_APB1ENR1_OFFSET)
#define STM32_RCC_APB1ENR2              (STM32_RCC_BASE + STM32_RCC_APB1ENR2_OFFSET)
#define STM32_RCC_APB2ENR               (STM32_RCC_BASE + STM32_RCC_APB2ENR_OFFSET)
#define STM32_RCC_APB4ENR               (STM32_RCC_BASE + STM32_RCC_APB4ENR_OFFSET)
#define STM32_RCC_AHB3ENR               (STM32_RCC_BASE + STM32_RCC_AHB3ENR_OFFSET)
#define STM32_RCC_AHB5LPENR             (STM32_RCC_BASE + STM32_RCC_AHB5LPENR_OFFSET)
#define STM32_RCC_AHB1LPENR             (STM32_RCC_BASE + STM32_RCC_AHB1LPENR_OFFSET)
#define STM32_RCC_AHB2LPENR             (STM32_RCC_BASE + STM32_RCC_AHB2LPENR_OFFSET)
#define STM32_RCC_AHB4LPENR             (STM32_RCC_BASE + STM32_RCC_AHB4LPENR_OFFSET)
#define STM32_RCC_AHB3LPENR             (STM32_RCC_BASE + STM32_RCC_AHB3LPENR_OFFSET)
#define STM32_RCC_APB1LPENR1            (STM32_RCC_BASE + STM32_RCC_APB1LPENR1_OFFSET)
#define STM32_RCC_APB1LPENR2            (STM32_RCC_BASE + STM32_RCC_APB1LPENR2_OFFSET)
#define STM32_RCC_APB2LPENR             (STM32_RCC_BASE + STM32_RCC_APB2LPENR_OFFSET)
#define STM32_RCC_APB4LPENR             (STM32_RCC_BASE + STM32_RCC_APB4LPENR_OFFSET)
#define STM32_RCC_APB5LPENR             (STM32_RCC_BASE + STM32_RCC_APB5LPENR_OFFSET)

/* Register Bitfield Definitions ********************************************/

/* Clock control register ***************************************************/

#define RCC_CR_HSION                    (1 << 0)  /* Internal high-speed clock enable */
#define RCC_CR_HSIKERON                 (1 << 1)  /* HSI kernel clock in stop mode */
#define RCC_CR_HSIRDY                   (1 << 2)  /* Internal high-speed clock ready */
#define RCC_CR_HSIDIV_SHIFT             (3)       /* Bits 3-4: HSI clock divider */
#define RCC_CR_HSIDIV_MASK              (3 << RCC_CR_HSIDIV_SHIFT)
#  define RCC_CR_HSIDIV_1               (0 << RCC_CR_HSIDIV_SHIFT)
#  define RCC_CR_HSIDIV_2               (1 << RCC_CR_HSIDIV_SHIFT)
#  define RCC_CR_HSIDIV_4               (2 << RCC_CR_HSIDIV_SHIFT)
#  define RCC_CR_HSIDIV_8               (3 << RCC_CR_HSIDIV_SHIFT)
#define RCC_CR_HSIDIVF                  (1 << 5)  /* HSI divider flag */
#define RCC_CR_CSION                    (1 << 7)  /* Internal CSI clock enable */
#define RCC_CR_CSIRDY                   (1 << 8)  /* Internal CSI clock ready */
#define RCC_CR_CSIKERON                 (1 << 9)  /* CSI kernel clock in stop mode */
#define RCC_CR_HSI48ON                  (1 << 12) /* Internal HSI48 clock enable */
#define RCC_CR_HSI48RDY                 (1 << 13) /* Internal HSI48 clock ready */
#define RCC_CR_HSEON                    (1 << 16) /* External high-speed clock enable */
#define RCC_CR_HSERDY                   (1 << 17) /* External high-speed clock ready */
#define RCC_CR_HSEBYP                   (1 << 18) /* External clock bypass */
#define RCC_CR_HSEEXT                   (1 << 19) /* HSE external source selection */
#define RCC_CR_HSECSSON                 (1 << 20) /* HSE clock security enable */
#define RCC_CR_PLL1ON                   (1 << 24) /* PLL1 enable */
#define RCC_CR_PLL1RDY                  (1 << 25) /* PLL1 ready */
#define RCC_CR_PLL2ON                   (1 << 26) /* PLL2 enable */
#define RCC_CR_PLL2RDY                  (1 << 27) /* PLL2 ready */
#define RCC_CR_PLL3ON                   (1 << 28) /* PLL3 enable */
#define RCC_CR_PLL3RDY                  (1 << 29) /* PLL3 ready */

