apache/nuttx/arch/arm/src/stm32h7/hardware/stm32h7rsxx_rcc.h
/* Oscillator configuration registers ***************************************/

#define RCC_HSICFGR_HSICAL_SHIFT        (0)  /* Bits 0-11: HSI calibration */
#define RCC_HSICFGR_HSICAL_MASK         (0xfff << RCC_HSICFGR_HSICAL_SHIFT)
#define RCC_HSICFGR_HSITRIM_SHIFT       (24) /* Bits 24-30: HSI trimming */
#define RCC_HSICFGR_HSITRIM_MASK        (0x7f << RCC_HSICFGR_HSITRIM_SHIFT)
#define RCC_HSICFGR_HSITRIM(n)          ((n) << RCC_HSICFGR_HSITRIM_SHIFT)
#define RCC_CRRCR_HSI48CAL_SHIFT        (0)  /* Bits 0-9: HSI48 calibration */
#define RCC_CRRCR_HSI48CAL_MASK         (0x3ff << RCC_CRRCR_HSI48CAL_SHIFT)
#define RCC_CSICFGR_CSICAL_SHIFT        (0)  /* Bits 0-9: CSI calibration */
#define RCC_CSICFGR_CSICAL_MASK         (0x3ff << RCC_CSICFGR_CSICAL_SHIFT)
#define RCC_CSICFGR_CSITRIM_SHIFT       (24) /* Bits 24-28: CSI trimming */
#define RCC_CSICFGR_CSITRIM_MASK        (31 << RCC_CSICFGR_CSITRIM_SHIFT)
#define RCC_CSICFGR_CSITRIM(n)          ((n) << RCC_CSICFGR_CSITRIM_SHIFT)

/* Clock configuration registers ********************************************/

#define RCC_CFGR_SW_SHIFT               (0)       /* Bits 0-2: System clock switch */
#define RCC_CFGR_SW_MASK                (7 << RCC_CFGR_SW_SHIFT)
#  define RCC_CFGR_SW_HSI               (0 << RCC_CFGR_SW_SHIFT)
#  define RCC_CFGR_SW_CSI               (1 << RCC_CFGR_SW_SHIFT)
#  define RCC_CFGR_SW_HSE               (2 << RCC_CFGR_SW_SHIFT)
#  define RCC_CFGR_SW_PLL1              (3 << RCC_CFGR_SW_SHIFT)
#define RCC_CFGR_SWS_SHIFT              (3)       /* Bits 3-5: System clock status */
#define RCC_CFGR_SWS_MASK               (7 << RCC_CFGR_SWS_SHIFT)
#  define RCC_CFGR_SWS_HSI              (0 << RCC_CFGR_SWS_SHIFT)
#  define RCC_CFGR_SWS_CSI              (1 << RCC_CFGR_SWS_SHIFT)
#  define RCC_CFGR_SWS_HSE              (2 << RCC_CFGR_SWS_SHIFT)
#  define RCC_CFGR_SWS_PLL1             (3 << RCC_CFGR_SWS_SHIFT)
#define RCC_CFGR_STOPWUCK               (1 << 6)  /* System wakeup clock select */
#define RCC_CFGR_STOPKERWUCK            (1 << 7)  /* Kernel wakeup clock select */
#define RCC_CFGR_RTCPRE_SHIFT           (8)       /* Bits 8-13: HSE RTC prescaler */
#define RCC_CFGR_RTCPRE_MASK            (0x3f << RCC_CFGR_RTCPRE_SHIFT)
#define RCC_CFGR_RTCPRE(n)              ((n) << RCC_CFGR_RTCPRE_SHIFT)
#define RCC_CFGR_TIMPRE                 (1 << 15) /* Timer clock prescaler */
#define RCC_CFGR_MCO1PRE_SHIFT          (18)      /* Bits 18-21: MCO1 prescaler */
#define RCC_CFGR_MCO1PRE_MASK           (15 << RCC_CFGR_MCO1PRE_SHIFT)
#define RCC_CFGR_MCO1PRE(n)             ((n) << RCC_CFGR_MCO1PRE_SHIFT)
#define RCC_CFGR_MCO1_SHIFT             (22)      /* Bits 22-24: MCO1 source */
#define RCC_CFGR_MCO1_MASK              (7 << RCC_CFGR_MCO1_SHIFT)
#define RCC_CFGR_MCO2PRE_SHIFT          (25)      /* Bits 25-28: MCO2 prescaler */
#define RCC_CFGR_MCO2PRE_MASK           (15 << RCC_CFGR_MCO2PRE_SHIFT)
#define RCC_CFGR_MCO2PRE(n)             ((n) << RCC_CFGR_MCO2PRE_SHIFT)
#define RCC_CFGR_MCO2_SHIFT             (29)      /* Bits 29-31: MCO2 source */
#define RCC_CFGR_MCO2_MASK              (7u << RCC_CFGR_MCO2_SHIFT)

#define RCC_CDCFGR_CPRE_SHIFT           (0) /* CPU clock prescaler */
#define RCC_CDCFGR_CPRE_MASK            (15 << RCC_CDCFGR_CPRE_SHIFT)
#  define RCC_CDCFGR_CPRE_SYSCLK        (0 << RCC_CDCFGR_CPRE_SHIFT)
#  define RCC_CDCFGR_CPRE_SYSCLKd2      (8 << RCC_CDCFGR_CPRE_SHIFT)
#  define RCC_CDCFGR_CPRE_SYSCLKd4      (9 << RCC_CDCFGR_CPRE_SHIFT)
#  define RCC_CDCFGR_CPRE_SYSCLKd8      (10 << RCC_CDCFGR_CPRE_SHIFT)
#  define RCC_CDCFGR_CPRE_SYSCLKd16     (11 << RCC_CDCFGR_CPRE_SHIFT)
#  define RCC_CDCFGR_CPRE_SYSCLKd64     (12 << RCC_CDCFGR_CPRE_SHIFT)
#  define RCC_CDCFGR_CPRE_SYSCLKd128    (13 << RCC_CDCFGR_CPRE_SHIFT)
#  define RCC_CDCFGR_CPRE_SYSCLKd256    (14 << RCC_CDCFGR_CPRE_SHIFT)
#  define RCC_CDCFGR_CPRE_SYSCLKd512    (15 << RCC_CDCFGR_CPRE_SHIFT)

#define RCC_BMCFGR_HPRE_SHIFT           (0) /* AHB clock prescaler */
#define RCC_BMCFGR_HPRE_MASK            (15 << RCC_BMCFGR_HPRE_SHIFT)
#  define RCC_BMCFGR_HPRE_SYSCLK        (0 << RCC_BMCFGR_HPRE_SHIFT)
#  define RCC_BMCFGR_HPRE_SYSCLKd2      (8 << RCC_BMCFGR_HPRE_SHIFT)
#  define RCC_BMCFGR_HPRE_SYSCLKd4      (9 << RCC_BMCFGR_HPRE_SHIFT)
#  define RCC_BMCFGR_HPRE_SYSCLKd8      (10 << RCC_BMCFGR_HPRE_SHIFT)
#  define RCC_BMCFGR_HPRE_SYSCLKd16     (11 << RCC_BMCFGR_HPRE_SHIFT)
#  define RCC_BMCFGR_HPRE_SYSCLKd64     (12 << RCC_BMCFGR_HPRE_SHIFT)
#  define RCC_BMCFGR_HPRE_SYSCLKd128    (13 << RCC_BMCFGR_HPRE_SHIFT)
#  define RCC_BMCFGR_HPRE_SYSCLKd256    (14 << RCC_BMCFGR_HPRE_SHIFT)
#  define RCC_BMCFGR_HPRE_SYSCLKd512    (15 << RCC_BMCFGR_HPRE_SHIFT)

#define RCC_APBCFGR_PPRE1_SHIFT         (0)  /* APB1 clock prescaler */
#define RCC_APBCFGR_PPRE1_MASK          (7 << RCC_APBCFGR_PPRE1_SHIFT)
#  define RCC_APBCFGR_PPRE1_HCLK        (0 << RCC_APBCFGR_PPRE1_SHIFT)
#  define RCC_APBCFGR_PPRE1_HCLKd2      (4 << RCC_APBCFGR_PPRE1_SHIFT)
#  define RCC_APBCFGR_PPRE1_HCLKd4      (5 << RCC_APBCFGR_PPRE1_SHIFT)
#  define RCC_APBCFGR_PPRE1_HCLKd8      (6 << RCC_APBCFGR_PPRE1_SHIFT)
#  define RCC_APBCFGR_PPRE1_HCLKd16     (7 << RCC_APBCFGR_PPRE1_SHIFT)
#define RCC_APBCFGR_PPRE2_SHIFT         (4)  /* APB2 clock prescaler */
#define RCC_APBCFGR_PPRE2_MASK          (7 << RCC_APBCFGR_PPRE2_SHIFT)
#  define RCC_APBCFGR_PPRE2_HCLK        (0 << RCC_APBCFGR_PPRE2_SHIFT)
#  define RCC_APBCFGR_PPRE2_HCLKd2      (4 << RCC_APBCFGR_PPRE2_SHIFT)
#  define RCC_APBCFGR_PPRE2_HCLKd4      (5 << RCC_APBCFGR_PPRE2_SHIFT)
#  define RCC_APBCFGR_PPRE2_HCLKd8      (6 << RCC_APBCFGR_PPRE2_SHIFT)
#  define RCC_APBCFGR_PPRE2_HCLKd16     (7 << RCC_APBCFGR_PPRE2_SHIFT)
#define RCC_APBCFGR_PPRE4_SHIFT         (8)  /* APB4 clock prescaler */
#define RCC_APBCFGR_PPRE4_MASK          (7 << RCC_APBCFGR_PPRE4_SHIFT)
#  define RCC_APBCFGR_PPRE4_HCLK        (0 << RCC_APBCFGR_PPRE4_SHIFT)
#  define RCC_APBCFGR_PPRE4_HCLKd2      (4 << RCC_APBCFGR_PPRE4_SHIFT)
#  define RCC_APBCFGR_PPRE4_HCLKd4      (5 << RCC_APBCFGR_PPRE4_SHIFT)
#  define RCC_APBCFGR_PPRE4_HCLKd8      (6 << RCC_APBCFGR_PPRE4_SHIFT)
#  define RCC_APBCFGR_PPRE4_HCLKd16     (7 << RCC_APBCFGR_PPRE4_SHIFT)
#define RCC_APBCFGR_PPRE5_SHIFT         (12) /* APB5 clock prescaler */
#define RCC_APBCFGR_PPRE5_MASK          (7 << RCC_APBCFGR_PPRE5_SHIFT)
#  define RCC_APBCFGR_PPRE5_HCLK        (0 << RCC_APBCFGR_PPRE5_SHIFT)
#  define RCC_APBCFGR_PPRE5_HCLKd2      (4 << RCC_APBCFGR_PPRE5_SHIFT)
#  define RCC_APBCFGR_PPRE5_HCLKd4      (5 << RCC_APBCFGR_PPRE5_SHIFT)
#  define RCC_APBCFGR_PPRE5_HCLKd8      (6 << RCC_APBCFGR_PPRE5_SHIFT)
#  define RCC_APBCFGR_PPRE5_HCLKd16     (7 << RCC_APBCFGR_PPRE5_SHIFT)

/* PLL registers ************************************************************/

#define RCC_PLLCKSELR_PLLSRC_SHIFT      (0)  /* PLL clock source */
#define RCC_PLLCKSELR_PLLSRC_MASK       (3 << RCC_PLLCKSELR_PLLSRC_SHIFT)
#  define RCC_PLLCKSELR_PLLSRC_HSI      (0 << RCC_PLLCKSELR_PLLSRC_SHIFT)
#  define RCC_PLLCKSELR_PLLSRC_CSI      (1 << RCC_PLLCKSELR_PLLSRC_SHIFT)
#  define RCC_PLLCKSELR_PLLSRC_HSE      (2 << RCC_PLLCKSELR_PLLSRC_SHIFT)
#define RCC_PLLCKSELR_DIVM1_SHIFT       (4)  /* PLL1 M prescaler */
#define RCC_PLLCKSELR_DIVM2_SHIFT       (12) /* PLL2 M prescaler */
#define RCC_PLLCKSELR_DIVM3_SHIFT       (20) /* PLL3 M prescaler */
#define RCC_PLLCKSELR_DIVM_MASK(s)      (0x3f << (s))
#  define RCC_PLLCKSELR_DIVM(n,s)       ((n) << (s))
#  define RCC_PLLCKSELR_DIVM1(n)        RCC_PLLCKSELR_DIVM(n, RCC_PLLCKSELR_DIVM1_SHIFT)
#  define RCC_PLLCKSELR_DIVM2(n)        RCC_PLLCKSELR_DIVM(n, RCC_PLLCKSELR_DIVM2_SHIFT)
#  define RCC_PLLCKSELR_DIVM3(n)        RCC_PLLCKSELR_DIVM(n, RCC_PLLCKSELR_DIVM3_SHIFT)

#define RCC_PLLCFGR_PLL1FRACEN          (1 << 0)  /* PLL1 fractional enable */
#define RCC_PLLCFGR_PLL1VCOSEL          (1 << 1)  /* PLL1 VCO selection */
#define RCC_PLLCFGR_PLL1SSCGEN          (1 << 2)
#define RCC_PLLCFGR_PLL1RGE_SHIFT       (3)       /* PLL1 input freq range */
#define RCC_PLLCFGR_PLL1RGE_MASK        (3 << RCC_PLLCFGR_PLL1RGE_SHIFT)
#  define RCC_PLLCFGR_PLL1RGE_1_2       (0 << RCC_PLLCFGR_PLL1RGE_SHIFT)
#  define RCC_PLLCFGR_PLL1RGE_2_4       (1 << RCC_PLLCFGR_PLL1RGE_SHIFT)
#  define RCC_PLLCFGR_PLL1RGE_4_8       (2 << RCC_PLLCFGR_PLL1RGE_SHIFT)
#  define RCC_PLLCFGR_PLL1RGE_8_16      (3 << RCC_PLLCFGR_PLL1RGE_SHIFT)
#define RCC_PLLCFGR_PLL1PEN             (1 << 5)  /* PLL1 P output enable */
#define RCC_PLLCFGR_PLL1QEN             (1 << 6)  /* PLL1 Q output enable */
#define RCC_PLLCFGR_PLL1REN             (1 << 7)  /* PLL1 R output enable */
#define RCC_PLLCFGR_PLL1SEN             (1 << 8)  /* PLL1 S output enable */
#define RCC_PLLCFGR_PLL2FRACEN          (1 << 11) /* PLL2 fractional enable */
#define RCC_PLLCFGR_PLL2VCOSEL          (1 << 12) /* PLL2 VCO selection */
#define RCC_PLLCFGR_PLL2SSCGEN          (1 << 13)
#define RCC_PLLCFGR_PLL2RGE_SHIFT       (14)      /* PLL2 input freq range */
#define RCC_PLLCFGR_PLL2RGE_MASK        (3 << RCC_PLLCFGR_PLL2RGE_SHIFT)
#define RCC_PLLCFGR_PLL2PEN             (1 << 16) /* PLL2 P output enable */
#define RCC_PLLCFGR_PLL2QEN             (1 << 17) /* PLL2 Q output enable */
#define RCC_PLLCFGR_PLL2REN             (1 << 18) /* PLL2 R output enable */
#define RCC_PLLCFGR_PLL2SEN             (1 << 19) /* PLL2 S output enable */
#define RCC_PLLCFGR_PLL2TEN             (1 << 20) /* PLL2 T output enable */
#define RCC_PLLCFGR_PLL3FRACEN          (1 << 22) /* PLL3 fractional enable */
#define RCC_PLLCFGR_PLL3VCOSEL          (1 << 23) /* PLL3 VCO selection */
#define RCC_PLLCFGR_PLL3SSCGEN          (1 << 24)
#define RCC_PLLCFGR_PLL3RGE_SHIFT       (25)      /* PLL3 input freq range */
#define RCC_PLLCFGR_PLL3RGE_MASK        (3 << RCC_PLLCFGR_PLL3RGE_SHIFT)
#define RCC_PLLCFGR_PLL3PEN             (1 << 27) /* PLL3 P output enable */
#define RCC_PLLCFGR_PLL3QEN             (1 << 28) /* PLL3 Q output enable */
#define RCC_PLLCFGR_PLL3REN             (1 << 29) /* PLL3 R output enable */
#define RCC_PLLCFGR_PLL3SEN             (1 << 30) /* PLL3 S output enable */

