apache/nuttx/arch/arm/src/stm32h7/hardware/stm32h7rsxx_rcc.h
#define RCC_PLLDIVR_DIVN_SHIFT          (0)  /* PLL N multiplier */
#define RCC_PLLDIVR_DIVP_SHIFT          (9)  /* PLL P divider */
#define RCC_PLLDIVR_DIVQ_SHIFT          (16) /* PLL Q divider */
#define RCC_PLLDIVR_DIVR_SHIFT          (24) /* PLL R divider */
#  define RCC_PLLDIVR_DIVN(n)           (((n) - 1) << RCC_PLLDIVR_DIVN_SHIFT)
#  define RCC_PLLDIVR_DIVP(n)           (((n) - 1) << RCC_PLLDIVR_DIVP_SHIFT)
#  define RCC_PLLDIVR_DIVQ(n)           (((n) - 1) << RCC_PLLDIVR_DIVQ_SHIFT)
#  define RCC_PLLDIVR_DIVR(n)           (((n) - 1) << RCC_PLLDIVR_DIVR_SHIFT)
#define RCC_PLL1DIVR1_N(n)              RCC_PLLDIVR_DIVN(n)
#define RCC_PLL1DIVR1_P(n)              RCC_PLLDIVR_DIVP(n)
#define RCC_PLL1DIVR1_Q(n)              RCC_PLLDIVR_DIVQ(n)
#define RCC_PLL1DIVR1_R(n)              RCC_PLLDIVR_DIVR(n)
#define RCC_PLL2DIVR1_N(n)              RCC_PLLDIVR_DIVN(n)
#define RCC_PLL2DIVR1_P(n)              RCC_PLLDIVR_DIVP(n)
#define RCC_PLL2DIVR1_Q(n)              RCC_PLLDIVR_DIVQ(n)
#define RCC_PLL2DIVR1_R(n)              RCC_PLLDIVR_DIVR(n)
#define RCC_PLL3DIVR1_N(n)              RCC_PLLDIVR_DIVN(n)
#define RCC_PLL3DIVR1_P(n)              RCC_PLLDIVR_DIVP(n)
#define RCC_PLL3DIVR1_Q(n)              RCC_PLLDIVR_DIVQ(n)
#define RCC_PLL3DIVR1_R(n)              RCC_PLLDIVR_DIVR(n)
#define RCC_PLLFRACR_FRACN_SHIFT        (3)  /* PLL fractional value */
#define RCC_PLLFRACR_FRACN_MASK         (0x1fff << RCC_PLLFRACR_FRACN_SHIFT)
#  define RCC_PLLFRACR_FRACN(n)         ((n) << RCC_PLLFRACR_FRACN_SHIFT)

/* Secondary PLL dividers and spread-spectrum registers *********************/

#define RCC_PLL1DIVR2_DIVS_SHIFT        (0) /* PLL1 S divider */
#define RCC_PLL1DIVR2_DIVS_MASK         (7 << RCC_PLL1DIVR2_DIVS_SHIFT)
#  define RCC_PLL1DIVR2_DIVS(n)         (((n) - 1) << RCC_PLL1DIVR2_DIVS_SHIFT)
#define RCC_PLL2DIVR2_DIVS_SHIFT        (0) /* PLL2 S divider */
#define RCC_PLL2DIVR2_DIVS_MASK         (7 << RCC_PLL2DIVR2_DIVS_SHIFT)
#  define RCC_PLL2DIVR2_DIVS(n)         (((n) - 1) << RCC_PLL2DIVR2_DIVS_SHIFT)
#define RCC_PLL2DIVR2_DIVT_SHIFT        (8) /* PLL2 T divider */
#define RCC_PLL2DIVR2_DIVT_MASK         (7 << RCC_PLL2DIVR2_DIVT_SHIFT)
#  define RCC_PLL2DIVR2_DIVT(n)         (((n) - 1) << RCC_PLL2DIVR2_DIVT_SHIFT)
#define RCC_PLL3DIVR2_DIVS_SHIFT        (0) /* PLL3 S divider */
#define RCC_PLL3DIVR2_DIVS_MASK         (7 << RCC_PLL3DIVR2_DIVS_SHIFT)
#  define RCC_PLL3DIVR2_DIVS(n)         (((n) - 1) << RCC_PLL3DIVR2_DIVS_SHIFT)

#define RCC_PLL1SSCGR_MODPER_SHIFT      (0)  /* Modulation period */
#define RCC_PLL1SSCGR_MODPER_MASK       (0x1fff << RCC_PLL1SSCGR_MODPER_SHIFT)
#  define RCC_PLL1SSCGR_MODPER(n)       ((n) << RCC_PLL1SSCGR_MODPER_SHIFT)
#define RCC_PLL1SSCGR_TPDFNDIS          (1 << 13)
#define RCC_PLL1SSCGR_RPDFNDIS          (1 << 14)
#define RCC_PLL1SSCGR_SPREADSEL         (1 << 15)
#define RCC_PLL1SSCGR_INCSTEP_SHIFT     (16) /* Increment step */
#define RCC_PLL1SSCGR_INCSTEP_MASK      (0x7fff << RCC_PLL1SSCGR_INCSTEP_SHIFT)
#  define RCC_PLL1SSCGR_INCSTEP(n)      ((n) << RCC_PLL1SSCGR_INCSTEP_SHIFT)

#define RCC_PLL2SSCGR_MODPER_SHIFT      (0)  /* Modulation period */
#define RCC_PLL2SSCGR_MODPER_MASK       (0x1fff << RCC_PLL2SSCGR_MODPER_SHIFT)
#  define RCC_PLL2SSCGR_MODPER(n)       ((n) << RCC_PLL2SSCGR_MODPER_SHIFT)
#define RCC_PLL2SSCGR_TPDFNDIS          (1 << 13)
#define RCC_PLL2SSCGR_RPDFNDIS          (1 << 14)
#define RCC_PLL2SSCGR_SPREADSEL         (1 << 15)
#define RCC_PLL2SSCGR_INCSTEP_SHIFT     (16) /* Increment step */
#define RCC_PLL2SSCGR_INCSTEP_MASK      (0x7fff << RCC_PLL2SSCGR_INCSTEP_SHIFT)
#  define RCC_PLL2SSCGR_INCSTEP(n)      ((n) << RCC_PLL2SSCGR_INCSTEP_SHIFT)

#define RCC_PLL3SSCGR_MODPER_SHIFT      (0)  /* Modulation period */
#define RCC_PLL3SSCGR_MODPER_MASK       (0x1fff << RCC_PLL3SSCGR_MODPER_SHIFT)
#  define RCC_PLL3SSCGR_MODPER(n)       ((n) << RCC_PLL3SSCGR_MODPER_SHIFT)
#define RCC_PLL3SSCGR_TPDFNDIS          (1 << 13)
#define RCC_PLL3SSCGR_RPDFNDIS          (1 << 14)
#define RCC_PLL3SSCGR_SPREADSEL         (1 << 15)
#define RCC_PLL3SSCGR_INCSTEP_SHIFT     (16) /* Increment step */
#define RCC_PLL3SSCGR_INCSTEP_MASK      (0x7fff << RCC_PLL3SSCGR_INCSTEP_SHIFT)
#  define RCC_PLL3SSCGR_INCSTEP(n)      ((n) << RCC_PLL3SSCGR_INCSTEP_SHIFT)

/* Kernel clock selection registers *****************************************/

#define RCC_CCIPR1_FMCSEL_SHIFT         (0)  /* FMC clock source */
#define RCC_CCIPR1_FMCSEL_MASK          (3 << RCC_CCIPR1_FMCSEL_SHIFT)
#  define RCC_CCIPR1_FMCSEL(n)          ((n) << RCC_CCIPR1_FMCSEL_SHIFT)
#define RCC_CCIPR1_SDMMC12SEL_SHIFT     (2)  /* SDMMC12 clock source */
#define RCC_CCIPR1_SDMMC12SEL_MASK      (1 << RCC_CCIPR1_SDMMC12SEL_SHIFT)
#  define RCC_CCIPR1_SDMMC12SEL(n)      ((n) << RCC_CCIPR1_SDMMC12SEL_SHIFT)
#define RCC_CCIPR1_XSPI1SEL_SHIFT       (4)  /* XSPI1 clock source */
#define RCC_CCIPR1_XSPI1SEL_MASK        (3 << RCC_CCIPR1_XSPI1SEL_SHIFT)
#  define RCC_CCIPR1_XSPI1SEL(n)        ((n) << RCC_CCIPR1_XSPI1SEL_SHIFT)
#  define RCC_CCIPR1_XSPI1SEL_HCLK      (0 << RCC_CCIPR1_XSPI1SEL_SHIFT)
#define RCC_CCIPR1_XSPI2SEL_SHIFT       (6)  /* XSPI2 clock source */
#define RCC_CCIPR1_XSPI2SEL_MASK        (3 << RCC_CCIPR1_XSPI2SEL_SHIFT)
#  define RCC_CCIPR1_XSPI2SEL(n)        ((n) << RCC_CCIPR1_XSPI2SEL_SHIFT)
#  define RCC_CCIPR1_XSPI2SEL_HCLK      (0 << RCC_CCIPR1_XSPI2SEL_SHIFT)
#define RCC_CCIPR1_USBREFCKSEL_SHIFT    (8)  /* USBREFCK clock source */
#define RCC_CCIPR1_USBREFCKSEL_MASK     (15 << RCC_CCIPR1_USBREFCKSEL_SHIFT)
#  define RCC_CCIPR1_USBREFCKSEL(n)     ((n) << RCC_CCIPR1_USBREFCKSEL_SHIFT)
#define RCC_CCIPR1_USBPHYCSEL_SHIFT     (12) /* USBPHYC clock source */
#define RCC_CCIPR1_USBPHYCSEL_MASK      (3 << RCC_CCIPR1_USBPHYCSEL_SHIFT)
#  define RCC_CCIPR1_USBPHYCSEL(n)      ((n) << RCC_CCIPR1_USBPHYCSEL_SHIFT)
#define RCC_CCIPR1_OTGFSSEL_SHIFT       (14) /* OTGFS clock source */
#define RCC_CCIPR1_OTGFSSEL_MASK        (3 << RCC_CCIPR1_OTGFSSEL_SHIFT)
#  define RCC_CCIPR1_OTGFSSEL(n)        ((n) << RCC_CCIPR1_OTGFSSEL_SHIFT)
#define RCC_CCIPR1_ETH1REFCKSEL_SHIFT   (16) /* ETH1REFCK clock source */
#define RCC_CCIPR1_ETH1REFCKSEL_MASK    (3 << RCC_CCIPR1_ETH1REFCKSEL_SHIFT)
#  define RCC_CCIPR1_ETH1REFCKSEL(n)    ((n) << RCC_CCIPR1_ETH1REFCKSEL_SHIFT)
#define RCC_CCIPR1_ETH1PHYCKSEL_SHIFT   (18) /* ETH1PHYCK clock source */
#define RCC_CCIPR1_ETH1PHYCKSEL_MASK    (1 << RCC_CCIPR1_ETH1PHYCKSEL_SHIFT)
#  define RCC_CCIPR1_ETH1PHYCKSEL(n)    ((n) << RCC_CCIPR1_ETH1PHYCKSEL_SHIFT)
#define RCC_CCIPR1_ADF1SEL_SHIFT        (20) /* ADF1 clock source */
#define RCC_CCIPR1_ADF1SEL_MASK         (7 << RCC_CCIPR1_ADF1SEL_SHIFT)
#  define RCC_CCIPR1_ADF1SEL(n)         ((n) << RCC_CCIPR1_ADF1SEL_SHIFT)
#define RCC_CCIPR1_ADCSEL_SHIFT         (24) /* ADC clock source */
#define RCC_CCIPR1_ADCSEL_MASK          (3 << RCC_CCIPR1_ADCSEL_SHIFT)
#  define RCC_CCIPR1_ADCSEL(n)          ((n) << RCC_CCIPR1_ADCSEL_SHIFT)
#define RCC_CCIPR1_PSSISEL_SHIFT        (27) /* PSSI clock source */
#define RCC_CCIPR1_PSSISEL_MASK         (1 << RCC_CCIPR1_PSSISEL_SHIFT)
#  define RCC_CCIPR1_PSSISEL(n)         ((n) << RCC_CCIPR1_PSSISEL_SHIFT)
#define RCC_CCIPR1_CKPERSEL_SHIFT       (28) /* CKPER clock source */
#define RCC_CCIPR1_CKPERSEL_MASK        (3 << RCC_CCIPR1_CKPERSEL_SHIFT)
#  define RCC_CCIPR1_CKPERSEL(n)        ((n) << RCC_CCIPR1_CKPERSEL_SHIFT)

