apache/nuttx/arch/arm/src/stm32h7/hardware/stm32h7rsxx_rcc.h
#define RCC_CCIPR2_UART234578SEL_SHIFT  (0)  /* UART234578 clock source */
#define RCC_CCIPR2_UART234578SEL_MASK   (7 << RCC_CCIPR2_UART234578SEL_SHIFT)
#  define RCC_CCIPR2_UART234578SEL(n)   ((n) << RCC_CCIPR2_UART234578SEL_SHIFT)
#define RCC_CCIPR2_SPI23SEL_SHIFT       (4)  /* SPI23 clock source */
#define RCC_CCIPR2_SPI23SEL_MASK        (7 << RCC_CCIPR2_SPI23SEL_SHIFT)
#  define RCC_CCIPR2_SPI23SEL(n)        ((n) << RCC_CCIPR2_SPI23SEL_SHIFT)
#define RCC_CCIPR2_I2C23SEL_SHIFT       (8)  /* I2C23 clock source */
#define RCC_CCIPR2_I2C23SEL_MASK        (3 << RCC_CCIPR2_I2C23SEL_SHIFT)
#  define RCC_CCIPR2_I2C23SEL(n)        ((n) << RCC_CCIPR2_I2C23SEL_SHIFT)
#define RCC_CCIPR2_I2C1_I3C1SEL_SHIFT   (12) /* I2C1/I3C1 clock source */
#define RCC_CCIPR2_I2C1_I3C1SEL_MASK    (3 << RCC_CCIPR2_I2C1_I3C1SEL_SHIFT)
#  define RCC_CCIPR2_I2C1_I3C1SEL(n)    ((n) << RCC_CCIPR2_I2C1_I3C1SEL_SHIFT)
#define RCC_CCIPR2_LPTIM1SEL_SHIFT      (16) /* LPTIM1 clock source */
#define RCC_CCIPR2_LPTIM1SEL_MASK       (7 << RCC_CCIPR2_LPTIM1SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM1SEL(n)       ((n) << RCC_CCIPR2_LPTIM1SEL_SHIFT)
#define RCC_CCIPR2_FDCANSEL_SHIFT       (22) /* FDCAN clock source */
#define RCC_CCIPR2_FDCANSEL_MASK        (3 << RCC_CCIPR2_FDCANSEL_SHIFT)
#  define RCC_CCIPR2_FDCANSEL(n)        ((n) << RCC_CCIPR2_FDCANSEL_SHIFT)
#define RCC_CCIPR2_SPDIFRXSEL_SHIFT     (24) /* SPDIFRX clock source */
#define RCC_CCIPR2_SPDIFRXSEL_MASK      (3 << RCC_CCIPR2_SPDIFRXSEL_SHIFT)
#  define RCC_CCIPR2_SPDIFRXSEL(n)      ((n) << RCC_CCIPR2_SPDIFRXSEL_SHIFT)
#define RCC_CCIPR2_CECSEL_SHIFT         (28) /* CEC clock source */
#define RCC_CCIPR2_CECSEL_MASK          (3 << RCC_CCIPR2_CECSEL_SHIFT)
#  define RCC_CCIPR2_CECSEL(n)          ((n) << RCC_CCIPR2_CECSEL_SHIFT)

#define RCC_CCIPR3_USART1SEL_SHIFT      (0)  /* USART1 clock source */
#define RCC_CCIPR3_USART1SEL_MASK       (7 << RCC_CCIPR3_USART1SEL_SHIFT)
#  define RCC_CCIPR3_USART1SEL(n)       ((n) << RCC_CCIPR3_USART1SEL_SHIFT)
#define RCC_CCIPR3_SPI45SEL_SHIFT       (4)  /* SPI45 clock source */
#define RCC_CCIPR3_SPI45SEL_MASK        (7 << RCC_CCIPR3_SPI45SEL_SHIFT)
#  define RCC_CCIPR3_SPI45SEL(n)        ((n) << RCC_CCIPR3_SPI45SEL_SHIFT)
#define RCC_CCIPR3_SPI1SEL_SHIFT        (8)  /* SPI1 clock source */
#define RCC_CCIPR3_SPI1SEL_MASK         (7 << RCC_CCIPR3_SPI1SEL_SHIFT)
#  define RCC_CCIPR3_SPI1SEL(n)         ((n) << RCC_CCIPR3_SPI1SEL_SHIFT)
#define RCC_CCIPR3_SAI1SEL_SHIFT        (16) /* SAI1 clock source */
#define RCC_CCIPR3_SAI1SEL_MASK         (7 << RCC_CCIPR3_SAI1SEL_SHIFT)
#  define RCC_CCIPR3_SAI1SEL(n)         ((n) << RCC_CCIPR3_SAI1SEL_SHIFT)
#define RCC_CCIPR3_SAI2SEL_SHIFT        (20) /* SAI2 clock source */
#define RCC_CCIPR3_SAI2SEL_MASK         (7 << RCC_CCIPR3_SAI2SEL_SHIFT)
#  define RCC_CCIPR3_SAI2SEL(n)         ((n) << RCC_CCIPR3_SAI2SEL_SHIFT)

#define RCC_CCIPR4_LPUART1SEL_SHIFT     (0)  /* LPUART1 clock source */
#define RCC_CCIPR4_LPUART1SEL_MASK      (7 << RCC_CCIPR4_LPUART1SEL_SHIFT)
#  define RCC_CCIPR4_LPUART1SEL(n)      ((n) << RCC_CCIPR4_LPUART1SEL_SHIFT)
#define RCC_CCIPR4_SPI6SEL_SHIFT        (4)  /* SPI6 clock source */
#define RCC_CCIPR4_SPI6SEL_MASK         (7 << RCC_CCIPR4_SPI6SEL_SHIFT)
#  define RCC_CCIPR4_SPI6SEL(n)         ((n) << RCC_CCIPR4_SPI6SEL_SHIFT)
#define RCC_CCIPR4_LPTIM23SEL_SHIFT     (8)  /* LPTIM23 clock source */
#define RCC_CCIPR4_LPTIM23SEL_MASK      (7 << RCC_CCIPR4_LPTIM23SEL_SHIFT)
#  define RCC_CCIPR4_LPTIM23SEL(n)      ((n) << RCC_CCIPR4_LPTIM23SEL_SHIFT)
#define RCC_CCIPR4_LPTIM45SEL_SHIFT     (12) /* LPTIM45 clock source */
#define RCC_CCIPR4_LPTIM45SEL_MASK      (7 << RCC_CCIPR4_LPTIM45SEL_SHIFT)
#  define RCC_CCIPR4_LPTIM45SEL(n)      ((n) << RCC_CCIPR4_LPTIM45SEL_SHIFT)

/* Clock interrupts *********************************************************/

#define RCC_CI_LSIRDY                   (1 << 0)  /* LSI ready */
#define RCC_CI_LSERDY                   (1 << 1)  /* LSE ready */
#define RCC_CI_HSIRDY                   (1 << 2)  /* HSI ready */
#define RCC_CI_HSERDY                   (1 << 3)  /* HSE ready */
#define RCC_CI_CSIRDY                   (1 << 4)  /* CSI ready */
#define RCC_CI_HSI48RDY                 (1 << 5)  /* HSI48 ready */
#define RCC_CI_PLL1RDY                  (1 << 6)  /* PLL1 ready */
#define RCC_CI_PLL2RDY                  (1 << 7)  /* PLL2 ready */
#define RCC_CI_PLL3RDY                  (1 << 8)  /* PLL3 ready */
#define RCC_CI_LSECSS                   (1 << 9)  /* LSE CSS failure */
#define RCC_CI_HSECSS                   (1 << 10) /* HSE CSS failure */

#define RCC_CIER_LSIRDYIE               RCC_CI_LSIRDY
#define RCC_CIER_LSERDYIE               RCC_CI_LSERDY
#define RCC_CIER_HSIRDYIE               RCC_CI_HSIRDY
#define RCC_CIER_HSERDYIE               RCC_CI_HSERDY
#define RCC_CIER_CSIRDYIE               RCC_CI_CSIRDY
#define RCC_CIER_HSI48RDYIE             RCC_CI_HSI48RDY
#define RCC_CIER_PLL1RDYIE              RCC_CI_PLL1RDY
#define RCC_CIER_PLL2RDYIE              RCC_CI_PLL2RDY
#define RCC_CIER_PLL3RDYIE              RCC_CI_PLL3RDY
#define RCC_CIER_LSECSSIE               RCC_CI_LSECSS
#define RCC_CIFR_LSIRDYF                RCC_CI_LSIRDY
#define RCC_CIFR_LSERDYF                RCC_CI_LSERDY
#define RCC_CIFR_HSIRDYF                RCC_CI_HSIRDY
#define RCC_CIFR_HSERDYF                RCC_CI_HSERDY
#define RCC_CIFR_CSIRDYF                RCC_CI_CSIRDY
#define RCC_CIFR_HSI48RDYF              RCC_CI_HSI48RDY
#define RCC_CIFR_PLL1RDYF               RCC_CI_PLL1RDY
#define RCC_CIFR_PLL2RDYF               RCC_CI_PLL2RDY
#define RCC_CIFR_PLL3RDYF               RCC_CI_PLL3RDY
#define RCC_CIFR_LSECSSF                RCC_CI_LSECSS
#define RCC_CIFR_HSECSSF                RCC_CI_HSECSS
#define RCC_CICR_LSIRDYC                RCC_CI_LSIRDY
#define RCC_CICR_LSERDYC                RCC_CI_LSERDY
#define RCC_CICR_HSIRDYC                RCC_CI_HSIRDY
#define RCC_CICR_HSERDYC                RCC_CI_HSERDY
#define RCC_CICR_CSIRDYC                RCC_CI_CSIRDY
#define RCC_CICR_HSI48RDYC              RCC_CI_HSI48RDY
#define RCC_CICR_PLL1RDYC               RCC_CI_PLL1RDY
#define RCC_CICR_PLL2RDYC               RCC_CI_PLL2RDY
#define RCC_CICR_PLL3RDYC               RCC_CI_PLL3RDY
#define RCC_CICR_LSECSSC                RCC_CI_LSECSS
#define RCC_CICR_HSECSSC                RCC_CI_HSECSS

/* Backup domain and reset status *******************************************/

#define RCC_BDCR_LSEON                  (1 << 0)  /* LSE enable */
#define RCC_BDCR_LSERDY                 (1 << 1)  /* LSE ready */
#define RCC_BDCR_LSEBYP                 (1 << 2)  /* LSE bypass */
#define RCC_BDCR_LSEDRV_SHIFT           (3)       /* LSE drive capability */
#define RCC_BDCR_LSEDRV_MASK            (3 << RCC_BDCR_LSEDRV_SHIFT)
#define RCC_BDCR_LSECSSON               (1 << 5)  /* LSE CSS enable */
#define RCC_BDCR_LSECSSD                (1 << 6)  /* LSE CSS failure flag */
#define RCC_BDCR_LSEEXT                 (1 << 7)  /* LSE external source */
#define RCC_BDCR_RTCSEL_SHIFT           (8)       /* RTC clock source */
#define RCC_BDCR_RTCSEL_MASK            (3 << RCC_BDCR_RTCSEL_SHIFT)
#  define RCC_BDCR_RTCSEL_NONE          (0 << RCC_BDCR_RTCSEL_SHIFT)
#  define RCC_BDCR_RTCSEL_LSE           (1 << RCC_BDCR_RTCSEL_SHIFT)
#  define RCC_BDCR_RTCSEL_LSI           (2 << RCC_BDCR_RTCSEL_SHIFT)
#  define RCC_BDCR_RTCSEL_HSE           (3 << RCC_BDCR_RTCSEL_SHIFT)
#define RCC_BDCR_LSECSSRA               (1 << 12)
#define RCC_BDCR_RTCEN                  (1 << 15) /* RTC clock enable */
#define RCC_BDCR_VSWRST                 (1 << 16) /* VSwitch domain reset */
#define RCC_CSR_LSION                   (1 << 0)  /* LSI enable */
#define RCC_CSR_LSIRDY                  (1 << 1)  /* LSI ready */

/* Clock gating and protection registers ************************************/

#define RCC_CKGDISR_AXICKG              (1 << 0)
#define RCC_CKGDISR_AHBMCKG             (1 << 1)
#define RCC_CKGDISR_SDMMC1CKG           (1 << 2)
#define RCC_CKGDISR_HPDMA1CKG           (1 << 3)
#define RCC_CKGDISR_CPUCKG              (1 << 4)
#define RCC_CKGDISR_GPU2DS0CKG          (1 << 5)
#define RCC_CKGDISR_GPU2DS1CKG          (1 << 6)
#define RCC_CKGDISR_GPU2DCLCKG          (1 << 7)
#define RCC_CKGDISR_DCMIPPCKG           (1 << 8)
#define RCC_CKGDISR_DMA2DCKG            (1 << 9)
#define RCC_CKGDISR_GFXMMUSCKG          (1 << 10)
#define RCC_CKGDISR_LTDCCKG             (1 << 11)
#define RCC_CKGDISR_GFXMMUMCKG          (1 << 12)
#define RCC_CKGDISR_AHBSCKG             (1 << 13)
#define RCC_CKGDISR_FMCCKG              (1 << 14)
#define RCC_CKGDISR_XSPI1CKG            (1 << 15)
#define RCC_CKGDISR_XSPI2CKG            (1 << 16)
#define RCC_CKGDISR_AXISRAM4CKG         (1 << 17)
#define RCC_CKGDISR_AXISRAM3CKG         (1 << 18)
#define RCC_CKGDISR_AXISRAM2CKG         (1 << 19)
#define RCC_CKGDISR_AXISRAM1CKG         (1 << 20)
#define RCC_CKGDISR_FLASHCKG            (1 << 21)
#define RCC_CKGDISR_EXTICKG             (1 << 30)
#define RCC_CKGDISR_JTAGCKG             (1 << 31)

#define RCC_CKPROTR_XSPICKP             (1 << 0) /* XSPI clock protection */
#define RCC_CKPROTR_FMCCKP              (1 << 1) /* FMC clock protection */
#define RCC_CKPROTR_XSPI1SWP_SHIFT      (4)      /* XSPI1 clock switch */
#define RCC_CKPROTR_XSPI1SWP_MASK       (7 << RCC_CKPROTR_XSPI1SWP_SHIFT)
#  define RCC_CKPROTR_XSPI1SWP(n)       ((n) << RCC_CKPROTR_XSPI1SWP_SHIFT)
#define RCC_CKPROTR_XSPI2SWP_SHIFT      (8)      /* XSPI2 clock switch */
#define RCC_CKPROTR_XSPI2SWP_MASK       (7 << RCC_CKPROTR_XSPI2SWP_SHIFT)
#  define RCC_CKPROTR_XSPI2SWP(n)       ((n) << RCC_CKPROTR_XSPI2SWP_SHIFT)
#define RCC_CKPROTR_FMCSWP_SHIFT        (12)     /* FMC clock switch */
#define RCC_CKPROTR_FMCSWP_MASK         (7 << RCC_CKPROTR_FMCSWP_SHIFT)
#  define RCC_CKPROTR_FMCSWP(n)         ((n) << RCC_CKPROTR_FMCSWP_SHIFT)

