apache/nuttx/arch/arm/src/stm32h7/hardware/stm32h7rsxx_rcc.h
/* Reset status register ****************************************************/

#define RCC_RSR_RMVF                    (1 << 16) /* Remove reset flag */
#define RCC_RSR_OBLRSTF                 (1 << 17) /* OBL reset flag */
#define RCC_RSR_BORRSTF                 (1 << 21) /* BOR reset flag */
#define RCC_RSR_PINRSTF                 (1 << 22) /* Pin reset flag */
#define RCC_RSR_PORRSTF                 (1 << 23) /* POR/PDR reset flag */
#define RCC_RSR_SFTRSTF                 (1 << 24) /* Software reset flag */
#define RCC_RSR_IWDGRSTF                (1 << 26) /* IWDG reset flag */
#define RCC_RSR_WWDGRSTF                (1 << 28) /* WWDG reset flag */
#define RCC_RSR_LPWRRSTF                (1 << 30) /* Low-power reset flag */

/* Peripheral reset registers ***********************************************/

#define RCC_AHB5RSTR_HPDMA1RST          (1 << 0)  /* HPDMA1 reset */
#define RCC_AHB5RSTR_DMA2DRST           (1 << 1)  /* DMA2D reset */
#define RCC_AHB5RSTR_JPEGRST            (1 << 3)  /* JPEG reset */
#define RCC_AHB5RSTR_FMCRST             (1 << 4)  /* FMC reset */
#define RCC_AHB5RSTR_XSPI1RST           (1 << 5)  /* XSPI1 reset */
#define RCC_AHB5RSTR_SDMMC1RST          (1 << 8)  /* SDMMC1 reset */
#define RCC_AHB5RSTR_XSPI2RST           (1 << 12) /* XSPI2 reset */
#define RCC_AHB5RSTR_XSPIMRST           (1 << 14) /* XSPIM reset */
#define RCC_AHB5RSTR_GFXMMURST          (1 << 19) /* GFXMMU reset */
#define RCC_AHB5RSTR_GPU2DRST           (1 << 20) /* GPU2D reset */

#define RCC_AHB1RSTR_GPDMA1RST          (1 << 4)  /* GPDMA1 reset */
#define RCC_AHB1RSTR_ADC12RST           (1 << 5)  /* ADC12 reset */
#define RCC_AHB1RSTR_ETH1MACRST         (1 << 15) /* ETH1 reset */
#define RCC_AHB1RSTR_OTGHSRST           (1 << 25) /* OTGHS reset */
#define RCC_AHB1RSTR_USBPHYCRST         (1 << 26) /* USBPHYC reset */
#define RCC_AHB1RSTR_OTGFSRST           (1 << 27) /* OTGFS reset */
#define RCC_AHB1RSTR_ADF1RST            (1 << 31) /* ADF1 reset */

#define RCC_AHB2RSTR_PSSIRST            (1 << 1)  /* PSSI reset */
#define RCC_AHB2RSTR_SDMMC2RST          (1 << 9)  /* SDMMC2 reset */
#define RCC_AHB2RSTR_CORDICRST          (1 << 14) /* CORDIC reset */

#define RCC_AHB4RSTR_GPIOARST           (1 << 0)  /* GPIOA reset */
#define RCC_AHB4RSTR_GPIOBRST           (1 << 1)  /* GPIOB reset */
#define RCC_AHB4RSTR_GPIOCRST           (1 << 2)  /* GPIOC reset */
#define RCC_AHB4RSTR_GPIODRST           (1 << 3)  /* GPIOD reset */
#define RCC_AHB4RSTR_GPIOERST           (1 << 4)  /* GPIOE reset */
#define RCC_AHB4RSTR_GPIOFRST           (1 << 5)  /* GPIOF reset */
#define RCC_AHB4RSTR_GPIOGRST           (1 << 6)  /* GPIOG reset */
#define RCC_AHB4RSTR_GPIOHRST           (1 << 7)  /* GPIOH reset */
#define RCC_AHB4RSTR_GPIOMRST           (1 << 12) /* GPIOM reset */
#define RCC_AHB4RSTR_GPIONRST           (1 << 13) /* GPION reset */
#define RCC_AHB4RSTR_GPIOORST           (1 << 14) /* GPIOO reset */
#define RCC_AHB4RSTR_GPIOPRST           (1 << 15) /* GPIOP reset */
#define RCC_AHB4RSTR_CRCRST             (1 << 19) /* CRC reset */

#define RCC_APB5RSTR_LTDCRST            (1 << 1) /* LTDC reset */
#define RCC_APB5RSTR_DCMIPPRST          (1 << 2) /* DCMIPP reset */
#define RCC_APB5RSTR_GFXTIMRST          (1 << 4) /* GFXTIM reset */

#define RCC_APB1RSTR1_TIM2RST           (1 << 0)  /* TIM2 reset */
#define RCC_APB1RSTR1_TIM3RST           (1 << 1)  /* TIM3 reset */
#define RCC_APB1RSTR1_TIM4RST           (1 << 2)  /* TIM4 reset */
#define RCC_APB1RSTR1_TIM5RST           (1 << 3)  /* TIM5 reset */
#define RCC_APB1RSTR1_TIM6RST           (1 << 4)  /* TIM6 reset */
#define RCC_APB1RSTR1_TIM7RST           (1 << 5)  /* TIM7 reset */
#define RCC_APB1RSTR1_TIM12RST          (1 << 6)  /* TIM12 reset */
#define RCC_APB1RSTR1_TIM13RST          (1 << 7)  /* TIM13 reset */
#define RCC_APB1RSTR1_TIM14RST          (1 << 8)  /* TIM14 reset */
#define RCC_APB1RSTR1_LPTIM1RST         (1 << 9)  /* LPTIM1 reset */
#define RCC_APB1RSTR1_SPI2RST           (1 << 14) /* SPI2 reset */
#define RCC_APB1RSTR1_SPI3RST           (1 << 15) /* SPI3 reset */
#define RCC_APB1RSTR1_SPDIFRXRST        (1 << 16) /* SPDIFRX reset */
#define RCC_APB1RSTR1_USART2RST         (1 << 17) /* USART2 reset */
#define RCC_APB1RSTR1_USART3RST         (1 << 18) /* USART3 reset */
#define RCC_APB1RSTR1_UART4RST          (1 << 19) /* UART4 reset */
#define RCC_APB1RSTR1_UART5RST          (1 << 20) /* UART5 reset */
#define RCC_APB1RSTR1_I2C1_I3C1RST      (1 << 21) /* I2C1/I3C1 reset */
#define RCC_APB1RSTR1_I2C2RST           (1 << 22) /* I2C2 reset */
#define RCC_APB1RSTR1_I2C3RST           (1 << 23) /* I2C3 reset */
#define RCC_APB1RSTR1_CECRST            (1 << 27) /* CEC reset */
#define RCC_APB1RSTR1_UART7RST          (1 << 30) /* UART7 reset */
#define RCC_APB1RSTR1_UART8RST          (1 << 31) /* UART8 reset */
#define RCC_APB1RSTR2_CRSRST            (1 << 1)  /* CRS reset */
#define RCC_APB1RSTR2_MDIOSRST          (1 << 5)  /* MDIOS reset */
#define RCC_APB1RSTR2_FDCANRST          (1 << 8)  /* FDCAN reset */
#define RCC_APB1RSTR2_UCPD1RST          (1 << 27) /* UCPD1 reset */

#define RCC_APB2RSTR_TIM1RST            (1 << 0)  /* TIM1 reset */
#define RCC_APB2RSTR_USART1RST          (1 << 4)  /* USART1 reset */
#define RCC_APB2RSTR_SPI1RST            (1 << 12) /* SPI1 reset */
#define RCC_APB2RSTR_SPI4RST            (1 << 13) /* SPI4 reset */
#define RCC_APB2RSTR_TIM15RST           (1 << 16) /* TIM15 reset */
#define RCC_APB2RSTR_TIM16RST           (1 << 17) /* TIM16 reset */
#define RCC_APB2RSTR_TIM17RST           (1 << 18) /* TIM17 reset */
#define RCC_APB2RSTR_TIM9RST            (1 << 19) /* TIM9 reset */
#define RCC_APB2RSTR_SPI5RST            (1 << 20) /* SPI5 reset */
#define RCC_APB2RSTR_SAI1RST            (1 << 22) /* SAI1 reset */
#define RCC_APB2RSTR_SAI2RST            (1 << 23) /* SAI2 reset */

#define RCC_APB4RSTR_SBSRST             (1 << 1)  /* SBS reset */
#define RCC_APB4RSTR_LPUART1RST         (1 << 3)  /* LPUART1 reset */
#define RCC_APB4RSTR_SPI6RST            (1 << 5)  /* SPI6 reset */
#define RCC_APB4RSTR_LPTIM2RST          (1 << 9)  /* LPTIM2 reset */
#define RCC_APB4RSTR_LPTIM3RST          (1 << 10) /* LPTIM3 reset */
#define RCC_APB4RSTR_LPTIM4RST          (1 << 11) /* LPTIM4 reset */
#define RCC_APB4RSTR_LPTIM5RST          (1 << 12) /* LPTIM5 reset */
#define RCC_APB4RSTR_VREFRST            (1 << 15) /* VREF reset */
#define RCC_APB4RSTR_DTSRST             (1 << 26) /* DTS reset */

#define RCC_AHB3RSTR_RNGRST             (1 << 0) /* RNG reset */
#define RCC_AHB3RSTR_HASHRST            (1 << 1) /* HASH reset */
#define RCC_AHB3RSTR_CRYPRST            (1 << 2) /* CRYP reset */
#define RCC_AHB3RSTR_SAESRST            (1 << 4) /* SAES reset */
#define RCC_AHB3RSTR_PKARST             (1 << 6) /* PKA reset */

/* Peripheral clock enable registers ****************************************/

#define RCC_AHB5ENR_HPDMA1EN            (1 << 0)  /* HPDMA1 clock enable */
#define RCC_AHB5ENR_DMA2DEN             (1 << 1)  /* DMA2D clock enable */
#define RCC_AHB5ENR_JPEGEN              (1 << 3)  /* JPEG clock enable */
#define RCC_AHB5ENR_FMCEN               (1 << 4)  /* FMC clock enable */
#define RCC_AHB5ENR_XSPI1EN             (1 << 5)  /* XSPI1 clock enable */
#define RCC_AHB5ENR_SDMMC1EN            (1 << 8)  /* SDMMC1 clock enable */
#define RCC_AHB5ENR_XSPI2EN             (1 << 12) /* XSPI2 clock enable */
#define RCC_AHB5ENR_XSPIMEN             (1 << 14) /* XSPIM clock enable */
#define RCC_AHB5ENR_GFXMMUEN            (1 << 19) /* GFXMMU clock enable */
#define RCC_AHB5ENR_GPU2DEN             (1 << 20) /* GPU2D clock enable */

