apache/nuttx/arch/arm/src/stm32h7/hardware/stm32h7rsxx_rcc.h
#define RCC_AHB1ENR_GPDMA1EN            (1 << 4)  /* GPDMA1 clock enable */
#define RCC_AHB1ENR_ADC12EN             (1 << 5)  /* ADC12 clock enable */
#define RCC_AHB1ENR_ETH1MACEN           (1 << 15) /* ETH1MAC clock enable */
#define RCC_AHB1ENR_ETH1TXEN            (1 << 16) /* ETH1TX clock enable */
#define RCC_AHB1ENR_ETH1RXEN            (1 << 17) /* ETH1RX clock enable */
#define RCC_AHB1ENR_OTGHSEN             (1 << 25) /* OTGHS clock enable */
#define RCC_AHB1ENR_USBPHYCEN           (1 << 26) /* USBPHYC clock enable */
#define RCC_AHB1ENR_OTGFSEN             (1 << 27) /* OTGFS clock enable */
#define RCC_AHB1ENR_ADF1EN              (1 << 31) /* ADF1 clock enable */

#define RCC_AHB2ENR_PSSIEN              (1 << 1)  /* PSSI clock enable */
#define RCC_AHB2ENR_SDMMC2EN            (1 << 9)  /* SDMMC2 clock enable */
#define RCC_AHB2ENR_CORDICEN            (1 << 14) /* CORDIC clock enable */
#define RCC_AHB2ENR_SRAM1EN             (1 << 29) /* SRAM1 clock enable */
#define RCC_AHB2ENR_SRAM2EN             (1 << 30) /* SRAM2 clock enable */

#define RCC_AHB4ENR_GPIOAEN             (1 << 0)  /* GPIOA clock enable */
#define RCC_AHB4ENR_GPIOBEN             (1 << 1)  /* GPIOB clock enable */
#define RCC_AHB4ENR_GPIOCEN             (1 << 2)  /* GPIOC clock enable */
#define RCC_AHB4ENR_GPIODEN             (1 << 3)  /* GPIOD clock enable */
#define RCC_AHB4ENR_GPIOEEN             (1 << 4)  /* GPIOE clock enable */
#define RCC_AHB4ENR_GPIOFEN             (1 << 5)  /* GPIOF clock enable */
#define RCC_AHB4ENR_GPIOGEN             (1 << 6)  /* GPIOG clock enable */
#define RCC_AHB4ENR_GPIOHEN             (1 << 7)  /* GPIOH clock enable */
#define RCC_AHB4ENR_GPIOMEN             (1 << 12) /* GPIOM clock enable */
#define RCC_AHB4ENR_GPIONEN             (1 << 13) /* GPION clock enable */
#define RCC_AHB4ENR_GPIOOEN             (1 << 14) /* GPIOO clock enable */
#define RCC_AHB4ENR_GPIOPEN             (1 << 15) /* GPIOP clock enable */
#define RCC_AHB4ENR_CRCEN               (1 << 19) /* CRC clock enable */
#define RCC_AHB4ENR_BKPRAMEN            (1 << 28) /* BKPRAM clock enable */

#define RCC_APB5ENR_LTDCEN              (1 << 1) /* LTDC clock enable */
#define RCC_APB5ENR_DCMIPPEN            (1 << 2) /* DCMIPP clock enable */
#define RCC_APB5ENR_GFXTIMEN            (1 << 4) /* GFXTIM clock enable */

#define RCC_APB1ENR1_TIM2EN             (1 << 0)  /* TIM2 clock enable */
#define RCC_APB1ENR1_TIM3EN             (1 << 1)  /* TIM3 clock enable */
#define RCC_APB1ENR1_TIM4EN             (1 << 2)  /* TIM4 clock enable */
#define RCC_APB1ENR1_TIM5EN             (1 << 3)  /* TIM5 clock enable */
#define RCC_APB1ENR1_TIM6EN             (1 << 4)  /* TIM6 clock enable */
#define RCC_APB1ENR1_TIM7EN             (1 << 5)  /* TIM7 clock enable */
#define RCC_APB1ENR1_TIM12EN            (1 << 6)  /* TIM12 clock enable */
#define RCC_APB1ENR1_TIM13EN            (1 << 7)  /* TIM13 clock enable */
#define RCC_APB1ENR1_TIM14EN            (1 << 8)  /* TIM14 clock enable */
#define RCC_APB1ENR1_LPTIM1EN           (1 << 9)  /* LPTIM1 clock enable */
#define RCC_APB1ENR1_WWDGEN             (1 << 11) /* WWDG clock enable */
#define RCC_APB1ENR1_SPI2EN             (1 << 14) /* SPI2 clock enable */
#define RCC_APB1ENR1_SPI3EN             (1 << 15) /* SPI3 clock enable */
#define RCC_APB1ENR1_SPDIFRXEN          (1 << 16) /* SPDIFRX clock enable */
#define RCC_APB1ENR1_USART2EN           (1 << 17) /* USART2 clock enable */
#define RCC_APB1ENR1_USART3EN           (1 << 18) /* USART3 clock enable */
#define RCC_APB1ENR1_UART4EN            (1 << 19) /* UART4 clock enable */
#define RCC_APB1ENR1_UART5EN            (1 << 20) /* UART5 clock enable */
#define RCC_APB1ENR1_I2C1_I3C1EN        (1 << 21) /* I2C1/I3C1 clock enable */
#define RCC_APB1ENR1_I2C2EN             (1 << 22) /* I2C2 clock enable */
#define RCC_APB1ENR1_I2C3EN             (1 << 23) /* I2C3 clock enable */
#define RCC_APB1ENR1_CECEN              (1 << 27) /* CEC clock enable */
#define RCC_APB1ENR1_UART7EN            (1 << 30) /* UART7 clock enable */
#define RCC_APB1ENR1_UART8EN            (1 << 31) /* UART8 clock enable */
#define RCC_APB1ENR2_CRSEN              (1 << 1)  /* CRS clock enable */
#define RCC_APB1ENR2_MDIOSEN            (1 << 5)  /* MDIOS clock enable */
#define RCC_APB1ENR2_FDCANEN            (1 << 8)  /* FDCAN clock enable */
#define RCC_APB1ENR2_UCPD1EN            (1 << 27) /* UCPD1 clock enable */

#define RCC_APB2ENR_TIM1EN              (1 << 0)  /* TIM1 clock enable */
#define RCC_APB2ENR_USART1EN            (1 << 4)  /* USART1 clock enable */
#define RCC_APB2ENR_SPI1EN              (1 << 12) /* SPI1 clock enable */
#define RCC_APB2ENR_SPI4EN              (1 << 13) /* SPI4 clock enable */
#define RCC_APB2ENR_TIM15EN             (1 << 16) /* TIM15 clock enable */
#define RCC_APB2ENR_TIM16EN             (1 << 17) /* TIM16 clock enable */
#define RCC_APB2ENR_TIM17EN             (1 << 18) /* TIM17 clock enable */
#define RCC_APB2ENR_TIM9EN              (1 << 19) /* TIM9 clock enable */
#define RCC_APB2ENR_SPI5EN              (1 << 20) /* SPI5 clock enable */
#define RCC_APB2ENR_SAI1EN              (1 << 22) /* SAI1 clock enable */
#define RCC_APB2ENR_SAI2EN              (1 << 23) /* SAI2 clock enable */

#define RCC_APB4ENR_SBSEN               (1 << 1)  /* SBS clock enable */
#define RCC_APB4ENR_LPUART1EN           (1 << 3)  /* LPUART1 clock enable */
#define RCC_APB4ENR_SPI6EN              (1 << 5)  /* SPI6 clock enable */
#define RCC_APB4ENR_LPTIM2EN            (1 << 9)  /* LPTIM2 clock enable */
#define RCC_APB4ENR_LPTIM3EN            (1 << 10) /* LPTIM3 clock enable */
#define RCC_APB4ENR_LPTIM4EN            (1 << 11) /* LPTIM4 clock enable */
#define RCC_APB4ENR_LPTIM5EN            (1 << 12) /* LPTIM5 clock enable */
#define RCC_APB4ENR_VREFEN              (1 << 15) /* VREF clock enable */
#define RCC_APB4ENR_RTCAPBEN            (1 << 16) /* RTCAPB clock enable */
#define RCC_APB4ENR_DTSEN               (1 << 26) /* DTS clock enable */

#define RCC_AHB3ENR_RNGEN               (1 << 0) /* RNG clock enable */
#define RCC_AHB3ENR_HASHEN              (1 << 1) /* HASH clock enable */
#define RCC_AHB3ENR_CRYPEN              (1 << 2) /* CRYP clock enable */
#define RCC_AHB3ENR_SAESEN              (1 << 4) /* SAES clock enable */
#define RCC_AHB3ENR_PKAEN               (1 << 6) /* PKA clock enable */

/* Peripheral clock sleep enable registers **********************************/

#define RCC_AHB1LPENR_GPDMA1LPEN        (1 << 4)  /* GPDMA1 sleep enable */
#define RCC_AHB1LPENR_ADC12LPEN         (1 << 5)  /* ADC12 sleep enable */
#define RCC_AHB1LPENR_ETH1MACLPEN       (1 << 15) /* ETH1MAC sleep enable */
#define RCC_AHB1LPENR_ETH1TXLPEN        (1 << 16) /* ETH1TX sleep enable */
#define RCC_AHB1LPENR_ETH1RXLPEN        (1 << 17) /* ETH1RX sleep enable */
#define RCC_AHB1LPENR_UCPDCTRL          (1 << 24)
#define RCC_AHB1LPENR_OTGHSLPEN         (1 << 25) /* OTGHS sleep enable */
#define RCC_AHB1LPENR_USBPHYCLPEN       (1 << 26) /* USBPHYC sleep enable */
#define RCC_AHB1LPENR_OTGFSLPEN         (1 << 27) /* OTGFS sleep enable */
#define RCC_AHB1LPENR_ADF1LPEN          (1 << 31) /* ADF1 sleep enable */

