apache/nuttx/arch/arm/src/stm32h7/hardware/stm32h7rsxx_rcc.h
#define RCC_AHB2LPENR_PSSILPEN          (1 << 1)  /* PSSI sleep enable */
#define RCC_AHB2LPENR_SDMMC2LPEN        (1 << 9)  /* SDMMC2 sleep enable */
#define RCC_AHB2LPENR_CORDICLPEN        (1 << 14) /* CORDIC sleep enable */
#define RCC_AHB2LPENR_SRAM1LPEN         (1 << 29) /* SRAM1 sleep enable */
#define RCC_AHB2LPENR_SRAM2LPEN         (1 << 30) /* SRAM2 sleep enable */

#define RCC_AHB3LPENR_RNGLPEN           (1 << 0) /* RNG sleep enable */
#define RCC_AHB3LPENR_HASHLPEN          (1 << 1) /* HASH sleep enable */
#define RCC_AHB3LPENR_CRYPLPEN          (1 << 2) /* CRYP sleep enable */
#define RCC_AHB3LPENR_SAESLPEN          (1 << 4) /* SAES sleep enable */
#define RCC_AHB3LPENR_PKALPEN           (1 << 6) /* PKA sleep enable */

#define RCC_AHB4LPENR_GPIOALPEN         (1 << 0)  /* GPIOA sleep enable */
#define RCC_AHB4LPENR_GPIOBLPEN         (1 << 1)  /* GPIOB sleep enable */
#define RCC_AHB4LPENR_GPIOCLPEN         (1 << 2)  /* GPIOC sleep enable */
#define RCC_AHB4LPENR_GPIODLPEN         (1 << 3)  /* GPIOD sleep enable */
#define RCC_AHB4LPENR_GPIOELPEN         (1 << 4)  /* GPIOE sleep enable */
#define RCC_AHB4LPENR_GPIOFLPEN         (1 << 5)  /* GPIOF sleep enable */
#define RCC_AHB4LPENR_GPIOGLPEN         (1 << 6)  /* GPIOG sleep enable */
#define RCC_AHB4LPENR_GPIOHLPEN         (1 << 7)  /* GPIOH sleep enable */
#define RCC_AHB4LPENR_GPIOMLPEN         (1 << 12) /* GPIOM sleep enable */
#define RCC_AHB4LPENR_GPIONLPEN         (1 << 13) /* GPION sleep enable */
#define RCC_AHB4LPENR_GPIOOLPEN         (1 << 14) /* GPIOO sleep enable */
#define RCC_AHB4LPENR_GPIOPLPEN         (1 << 15) /* GPIOP sleep enable */
#define RCC_AHB4LPENR_CRCLPEN           (1 << 19) /* CRC sleep enable */
#define RCC_AHB4LPENR_BKPRAMLPEN        (1 << 28) /* BKPRAM sleep enable */

#define RCC_AHB5LPENR_HPDMA1LPEN        (1 << 0)  /* HPDMA1 sleep enable */
#define RCC_AHB5LPENR_DMA2DLPEN         (1 << 1)  /* DMA2D sleep enable */
#define RCC_AHB5LPENR_FLASHLPEN         (1 << 2)  /* FLASH sleep enable */
#define RCC_AHB5LPENR_JPEGLPEN          (1 << 3)  /* JPEG sleep enable */
#define RCC_AHB5LPENR_FMCLPEN           (1 << 4)  /* FMC sleep enable */
#define RCC_AHB5LPENR_XSPI1LPEN         (1 << 5)  /* XSPI1 sleep enable */
#define RCC_AHB5LPENR_SDMMC1LPEN        (1 << 8)  /* SDMMC1 sleep enable */
#define RCC_AHB5LPENR_XSPI2LPEN         (1 << 12) /* XSPI2 sleep enable */
#define RCC_AHB5LPENR_XSPIMLPEN         (1 << 14) /* XSPIM sleep enable */
#define RCC_AHB5LPENR_GFXMMULPEN        (1 << 19) /* GFXMMU sleep enable */
#define RCC_AHB5LPENR_GPU2DLPEN         (1 << 20) /* GPU2D sleep enable */
#define RCC_AHB5LPENR_DTCM1LPEN         (1 << 28) /* DTCM1 sleep enable */
#define RCC_AHB5LPENR_DTCM2LPEN         (1 << 29) /* DTCM2 sleep enable */
#define RCC_AHB5LPENR_ITCMLPEN          (1 << 30) /* ITCM sleep enable */
#define RCC_AHB5LPENR_AXISRAMLPEN       (1 << 31) /* AXISRAM sleep enable */

#define RCC_APB1LPENR1_TIM2LPEN         (1 << 0)  /* TIM2 sleep enable */
#define RCC_APB1LPENR1_TIM3LPEN         (1 << 1)  /* TIM3 sleep enable */
#define RCC_APB1LPENR1_TIM4LPEN         (1 << 2)  /* TIM4 sleep enable */
#define RCC_APB1LPENR1_TIM5LPEN         (1 << 3)  /* TIM5 sleep enable */
#define RCC_APB1LPENR1_TIM6LPEN         (1 << 4)  /* TIM6 sleep enable */
#define RCC_APB1LPENR1_TIM7LPEN         (1 << 5)  /* TIM7 sleep enable */
#define RCC_APB1LPENR1_TIM12LPEN        (1 << 6)  /* TIM12 sleep enable */
#define RCC_APB1LPENR1_TIM13LPEN        (1 << 7)  /* TIM13 sleep enable */
#define RCC_APB1LPENR1_TIM14LPEN        (1 << 8)  /* TIM14 sleep enable */
#define RCC_APB1LPENR1_LPTIM1LPEN       (1 << 9)  /* LPTIM1 sleep enable */
#define RCC_APB1LPENR1_WWDGLPEN         (1 << 11) /* WWDG sleep enable */
#define RCC_APB1LPENR1_SPI2LPEN         (1 << 14) /* SPI2 sleep enable */
#define RCC_APB1LPENR1_SPI3LPEN         (1 << 15) /* SPI3 sleep enable */
#define RCC_APB1LPENR1_SPDIFRXLPEN      (1 << 16) /* SPDIFRX sleep enable */
#define RCC_APB1LPENR1_USART2LPEN       (1 << 17) /* USART2 sleep enable */
#define RCC_APB1LPENR1_USART3LPEN       (1 << 18) /* USART3 sleep enable */
#define RCC_APB1LPENR1_UART4LPEN        (1 << 19) /* UART4 sleep enable */
#define RCC_APB1LPENR1_UART5LPEN        (1 << 20) /* UART5 sleep enable */
#define RCC_APB1LPENR1_I2C1_I3C1LPEN    (1 << 21) /* I2C1/I3C1 sleep enable */
#define RCC_APB1LPENR1_I2C2LPEN         (1 << 22) /* I2C2 sleep enable */
#define RCC_APB1LPENR1_I2C3LPEN         (1 << 23) /* I2C3 sleep enable */
#define RCC_APB1LPENR1_CECLPEN          (1 << 27) /* CEC sleep enable */
#define RCC_APB1LPENR1_UART7LPEN        (1 << 30) /* UART7 sleep enable */
#define RCC_APB1LPENR1_UART8LPEN        (1 << 31) /* UART8 sleep enable */

#define RCC_APB1LPENR2_CRSLPEN          (1 << 1)  /* CRS sleep enable */
#define RCC_APB1LPENR2_MDIOSLPEN        (1 << 5)  /* MDIOS sleep enable */
#define RCC_APB1LPENR2_FDCANLPEN        (1 << 8)  /* FDCAN sleep enable */
#define RCC_APB1LPENR2_UCPD1LPEN        (1 << 27) /* UCPD1 sleep enable */

#define RCC_APB2LPENR_TIM1LPEN          (1 << 0)  /* TIM1 sleep enable */
#define RCC_APB2LPENR_USART1LPEN        (1 << 4)  /* USART1 sleep enable */
#define RCC_APB2LPENR_SPI1LPEN          (1 << 12) /* SPI1 sleep enable */
#define RCC_APB2LPENR_SPI4LPEN          (1 << 13) /* SPI4 sleep enable */
#define RCC_APB2LPENR_TIM15LPEN         (1 << 16) /* TIM15 sleep enable */
#define RCC_APB2LPENR_TIM16LPEN         (1 << 17) /* TIM16 sleep enable */
#define RCC_APB2LPENR_TIM17LPEN         (1 << 18) /* TIM17 sleep enable */
#define RCC_APB2LPENR_TIM9LPEN          (1 << 19) /* TIM9 sleep enable */
#define RCC_APB2LPENR_SPI5LPEN          (1 << 20) /* SPI5 sleep enable */
#define RCC_APB2LPENR_SAI1LPEN          (1 << 22) /* SAI1 sleep enable */
#define RCC_APB2LPENR_SAI2LPEN          (1 << 23) /* SAI2 sleep enable */

#define RCC_APB4LPENR_SBSLPEN           (1 << 1)  /* SBS sleep enable */
#define RCC_APB4LPENR_LPUART1LPEN       (1 << 3)  /* LPUART1 sleep enable */
#define RCC_APB4LPENR_SPI6LPEN          (1 << 5)  /* SPI6 sleep enable */
#define RCC_APB4LPENR_LPTIM2LPEN        (1 << 9)  /* LPTIM2 sleep enable */
#define RCC_APB4LPENR_LPTIM3LPEN        (1 << 10) /* LPTIM3 sleep enable */
#define RCC_APB4LPENR_LPTIM4LPEN        (1 << 11) /* LPTIM4 sleep enable */
#define RCC_APB4LPENR_LPTIM5LPEN        (1 << 12) /* LPTIM5 sleep enable */
#define RCC_APB4LPENR_VREFLPEN          (1 << 15) /* VREF sleep enable */
#define RCC_APB4LPENR_RTCAPBLPEN        (1 << 16) /* RTCAPB sleep enable */
#define RCC_APB4LPENR_DTSLPEN           (1 << 26) /* DTS sleep enable */

