apache/nuttx/arch/arm/src/stm32h7/hardware/stm32h7rsxx_rcc.h
#define RCC_APB5LPENR_LTDCLPEN          (1 << 1) /* LTDC sleep enable */
#define RCC_APB5LPENR_DCMIPPLPEN        (1 << 2) /* DCMIPP sleep enable */
#define RCC_APB5LPENR_GFXTIMLPEN        (1 << 4) /* GFXTIM sleep enable */

/* Legacy H7 register names used by common drivers **************************/

#define STM32_RCC_APB1LENR              STM32_RCC_APB1ENR1
#define STM32_RCC_APB1LRSTR             STM32_RCC_APB1RSTR1
#define RCC_APB1LENR_TIM2EN             RCC_APB1ENR1_TIM2EN
#define RCC_APB1LENR_TIM3EN             RCC_APB1ENR1_TIM3EN
#define RCC_APB1LENR_TIM4EN             RCC_APB1ENR1_TIM4EN
#define RCC_APB1LENR_TIM5EN             RCC_APB1ENR1_TIM5EN
#define RCC_APB1LENR_TIM6EN             RCC_APB1ENR1_TIM6EN
#define RCC_APB1LENR_TIM7EN             RCC_APB1ENR1_TIM7EN
#define RCC_APB1LENR_LPTIM1EN           RCC_APB1ENR1_LPTIM1EN
#define RCC_APB1LENR_SPI2EN             RCC_APB1ENR1_SPI2EN
#define RCC_APB1LENR_SPI3EN             RCC_APB1ENR1_SPI3EN
#define RCC_APB1LENR_USART2EN           RCC_APB1ENR1_USART2EN
#define RCC_APB1LENR_USART3EN           RCC_APB1ENR1_USART3EN
#define RCC_APB1LENR_UART4EN            RCC_APB1ENR1_UART4EN
#define RCC_APB1LENR_UART5EN            RCC_APB1ENR1_UART5EN
#define RCC_APB1LENR_I2C1EN             RCC_APB1ENR1_I2C1_I3C1EN
#define RCC_APB1LENR_I2C2EN             RCC_APB1ENR1_I2C2EN
#define RCC_APB1LENR_I2C3EN             RCC_APB1ENR1_I2C3EN
#define RCC_APB1LENR_UART7EN            RCC_APB1ENR1_UART7EN
#define RCC_APB1LENR_UART8EN            RCC_APB1ENR1_UART8EN
#define RCC_APB1LRSTR_I2C1RST           RCC_APB1RSTR1_I2C1_I3C1RST
#define RCC_APB1LRSTR_I2C2RST           RCC_APB1RSTR1_I2C2RST
#define RCC_APB1LRSTR_I2C3RST           RCC_APB1RSTR1_I2C3RST

#endif /* __ARCH_ARM_SRC_STM32H7_HARDWARE_STM32H7RSXX_RCC_H */
